bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
        // Write the e_thru_f nibble to the memory address is lives in

        const nibble_t lpin_e_thru_g_nibble_index = lpin_nibble(lpin_e_thru_g);

        set_nibble( &lcd_mem_reg[lcdmem_offset_e_thru_g] , lpin_e_thru_g_nibble_index , nibble_e_thru_g );

    }

}



// Wiggle the flash LED IO pins at about 10Hz for testing

void wiggleFlash() {
    // Set Q1 & Q2 transistor pins to output
    SBI( Q1_TOP_LED_PDIR , Q1_TOP_LED_B );
    SBI( Q2_BOT_LED_PDIR , Q2_BOT_LED_B );

    while (1) {

        SBI( Q1_TOP_LED_POUT , Q1_TOP_LED_B );
        CBI( Q2_BOT_LED_POUT , Q2_BOT_LED_B );
        __delay_cycles(100000);

        CBI( Q1_TOP_LED_POUT , Q1_TOP_LED_B );
        SBI( Q2_BOT_LED_POUT , Q2_BOT_LED_B );
        __delay_cycles(100000);

    }

}

volatile unsigned char * Seconds = &BAKMEM0_L;               // Store seconds in the backup RAM module
volatile unsigned char * Minutes = &BAKMEM0_H;               // Store minutes in the backup RAM module
volatile unsigned char * Hours = &BAKMEM1_L;                 // Store hours in the backup RAM module
volatile unsigned char * spin = &BAKMEM1_H;                 // Store hours in the backup RAM module



int main( void )
{
    WDTCTL = WDTPW | WDTHOLD;                               // Stop watchdog timer
    if ( 0 /* && SYSRSTIV == SYSRSTIV_LPM5WU */)                        // If LPM3.5 wakeup
    {

        SBI( P1DIR , 1 );
        SBI( P1OUT , 1 );
        CBI( P1OUT , 1 );

        /*
         * When an overflow occurs, the RTCIFG bit in the RTCCTL register is set until it is cleared by a read of the
         * RTCIV register. At the same time, an interrupt is submitted to the CPU for post-processing, if the RTCIE
         * bit in the RTCCTL register is set. Reading RTCIV register clears the interrupt flag.
         */

        RTCIV; // Clear RTC interrupt. If we do not do this then the RTC ISR will be needlessly called when drop into LPM3.5


        // Initialize GPIO pins for low power
        // Configure all GPIO to Output Low
        P1OUT = 0x00;P2OUT = 0x00;P3OUT = 0x00;P4OUT = 0x00;
        P5OUT = 0x00;P6OUT = 0x00;P7OUT = 0x00;P8OUT = 0x00;


        // CLKIN from RV3032 as INPUT, PULL-UP

        CBI( RV3032_INT_PDIR , RV3032_INT_B);
        SBI( RV3032_INT_PREN , RV3032_INT_B);


       // Configure LCD pins
       SYSCFG2 |= LCDPCTL;


        // Disable the GPIO power-on default high-impedance mode
        // to activate previously configured port settings
        PM5CTL0 &= ~LOCKLPM5;


        //CLOCK_IN_PIV;   // Read and throw away to clear the PORT1 pin change interrupt flag. Only clears the top one but we only expect to have one.
        P1IFG = 0x00;

        RV3032_INT_PIE |= _BV( RV3032_INT_B );          // Enable interrupt on the clock_in pin. By default this will be low-to-high triggered


        // toggle low power waveform so we can see if it is visible (turns out only visible from wide viewing angles)
        // Divide by 1 (so CLK will be 10Khz), Very Low Osc, Turn on LCD, 4-mux selected (LCD4MUX also includes LCDSON), Low power waveform
        //LCDCTL0 ^= LCDLP ;

        switch (*Seconds) {

            case 0:
                *Seconds=1;
                lcd_show< 0,1>();
                break;

            case 1:
                *Seconds=2;
                lcd_show< 0,2>();
                break;

            case 2:
                *Seconds=3;
                lcd_show< 0,3>();
                break;

            case 3:
                *Seconds=4;
                lcd_show< 0,4>();
                break;

            case 4:
                *Seconds=5;
                lcd_show< 0,5>();
                break;

            case 5:
                *Seconds=6;
                lcd_show< 0,6>();
                break;

            case 6:
                *Seconds=7;
                lcd_show< 0,7>();
                break;

            case 7:
                *Seconds=8;
                lcd_show< 0,8>();
                break;

            case 8:
                *Seconds=9;
                lcd_show< 0,9>();
                break;

            case 9:
                *Seconds=0;
                lcd_show< 0,0>();
                break;


            default:
                *Seconds=0;
                lcd_show< 0,0>();
                break;

        }


        if (TBI(RV3032_INT_PIN,RV3032_INT_B)) {
            lcd_show<11,1>();
        } else {
            lcd_show<11,0>();

        }

        PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
        PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
        __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

        // We never get here because LPM3.5 reboots on wake


    }
    else
    {

        // Disable the GPIO power-on default high-impedance mode
        // to activate previously configured port settings
        PM5CTL0 &= ~LOCKLPM5;


        //TODO: Init our own stack save the wasteful init
        //STACK_INIT();


        // TODO: use the full word-wide registers
        // Initialize GPIO pins for low power
        P1DIR = 0xFF;P2DIR = 0xFF;P3DIR = 0xFF;P4DIR = 0xFF;
        P5DIR = 0xFF;P6DIR = 0xFF;P7DIR = 0xFF;P8DIR = 0xFF;
        // Configure all GPIO to Output Low
        P1OUT = 0x00;P2OUT = 0x00;P3OUT = 0x00;P4OUT = 0x00;
        P5OUT = 0x00;P6OUT = 0x00;P7OUT = 0x00;P8OUT = 0x00;

        // CLKIN from RV3032 as INPUT

        CBI( RV3032_INT_PDIR , RV3032_INT_B);

        // Debug pins
        SBI( DEBUGA_PDIR , DEBUGA_B );


        // Disable the GPIO power-on default high-impedance mode
        // to activate previously configured port settings
        PM5CTL0 &= ~LOCKLPM5;

/*
        SBI( P1DIR , 1 );
        SBI( P1OUT , 1 );

*/

        /*
            // This code is for testing LCD individual segments, it outputs out of phase square waves on MSP430 pins 1 and 2.
            // Connect one to SEG and one to COM and the segment should lite.
            while (1) {
                P7OUT = 0b10101010;
                __delay_cycles( 10000 );    // 100Hz
                P7OUT = 0b01010101;
                __delay_cycles( 10000 );    // 100Hz
            }
        */


        //RTCCTL = RTCSS__VLOCLK ;                    // Initialize RTC to use VLO clock

        // Configure LCD pins
        SYSCFG2 |= LCDPCTL;                                 // LCD R13/R23/R33/LCDCAP0/LCDCAP1 pins enabled

        // TODO: We can make a template to compute these from logical_digits
        LCDPCTL0 = 0b1111111111111111;  // LCD pins L15-L00, 1=enabled
        LCDPCTL1 = 0b1111111111111111;  // LCD pins L31-L16, 1=enabled
        LCDPCTL2 = 0b0000000000001111;  // LCD pins L37-L32, 1=enabled

