bigjosh/TSL-calibre-MSP/CCS Project/msp430fr413x_LCDE_03.c/tsl-calibre-msp.cpp
        // set TD to 00 for 4068Hz timer, TE=1 to enable periodic countdown timer
        uint8_t control1_reg = 0b00001000;
        i2c_write( RV_3032_I2C_ADDR , 0x10 , &control1_reg , 1 );

        // Set TIE in Control 2 to 1 t enable interrupt pin for periodic countdown
        uint8_t control2_reg = 0b00010000;
        i2c_write( RV_3032_I2C_ADDR , 0x11 , &control2_reg , 1 );


        // Periodic Timer value = 2048 for 500ms

        const unsigned timerValue = 2048;
        uint8_t timerValueH = timerValue / 0x100;
        uint8_t timerValueL = timerValue % 0x100;
        i2c_write( RV_3032_I2C_ADDR , 0x0b , &timerValueL  , 1 );
        i2c_write( RV_3032_I2C_ADDR , 0x0c , &timerValueH  , 1 );

        // Set TD= 01 for 4096Hz

        //uint8_t pmu_reg = 0b01010000;       // No CLKOUT, Switchover when VDD < VBACKUP, Trickle Charger off
        //i2c_write( RV_3032_I2C_ADDR , 0xc0 , &pmu_reg , 1 ); // Disable CLKOUT


        // Now we need to setup interrupt on clock_in pin to wake us

       RV3032_INT_PDIR &= ~_BV( RV3032_INT_B );
       RV3032_INT_POUT |= _BV( RV3032_INT_B );// Pull-up
       RV3032_INT_PREN |= _BV( RV3032_INT_B );


       P1IFG = 0x00;

       RV3032_INT_PIE |= _BV( RV3032_INT_B );          // Enable interrupt on the clock_in pin. By default this will be low-to-high triggered



        // TODO: Why doesn't this work?
        //LCDMEMCTL |= LCDCLRM;                               // Clear LCD memory command (executed one shot)
        //while (LCDMEMCTL & LCDCLRM);                        // Wait for clear to complete before moving on

        lcd_show< 0,0>();
        lcd_show< 1,1>();
        lcd_show< 2,2>();
        lcd_show< 3,3>();
        lcd_show< 4,4>();
        lcd_show< 5,5>();
        lcd_show< 6,6>();
        lcd_show< 7,7>();
        lcd_show< 8,8>();
        lcd_show< 9,9>();
        lcd_show<10,0>();
        lcd_show<11,5>();

        unsigned f = PMMIFG;        // Read reset flags

        if (f & PMMLPM5IFG) {       // Wake from LPMx.5
            lcd_show< 7,1>();
        }


        if (f & SVSHIFG) {          // SVS low side interrupt flag (power up)
            lcd_show< 6,1>();
        }


        if (f & PMMPORIFG) {
            lcd_show< 5,1>();
        }

        if (f & PMMPORIFG) {
            lcd_show< 4,1>();
        }

        if (f & PMMRSTIFG) {            // Reset pin
              lcd_show< 3,1>();
          }


        if (f & PMMBORIFG) {
              lcd_show< 2,1>();
         }


        SYSRSTIV = 0x00;
        unsigned iv = SYSRSTIV;

        if (iv!=0x0000) {
            lcd_show< 1,0>();
        }

        //Enter LPM3 with SVS off
        //PMMCTL0_L &= ~SVSHE ;                           // disable SVS (prob ~0.2uA, default is on)
        //TODO:Turn off LPM3.5 switch before sleeping? //LPM5SW

        // Datasheet says this will be 1.25uA with LCD...
        // Low-power mode 3, VLO, excludes SVS test conditions:
        // Current for watchdog timer clocked by VLO included. RTC disabled. Current for brownout included. SVS disabled (SVSHE = 0).
        // CPUOFF = 1, SCG0 = 1 SCG1 = 1, OSCOFF = 0 (LPM3),

        // "the WDTHOLD bit can be used to hold the WDTCNT, reducing power consumption."



        //WDTCTL = WDTPW | WDTSSEL__VLO | WDTHOLD;                               // Select VLO for WDT clock, halt watchdog timer



        // "After reset, RTCSS defaults to 00b (disabled), which means that no clock source is selected."

/*

        PMMCTL0_H = PMMPW_H;                            // Open PMM Registers for write
        PMMCTL0_L &= ~SVSHE ;                           // disable SVS

        __bis_SR_register( CPUOFF | SCG1 | OSCOFF  );                 // Enter LPM3 with datasheet specified flags.

*/


        /*
            Reset interrupt vector. Generates a value that can be used as address offset for
            fast interrupt service routine handling to identify the last cause of a reset (BOR,
            POR, or PUC). Writing to this register clears all pending reset source flags.
        */

        SYSRSTIV = 0x00;            // Clear all pending reset sources


        // Go into LPM3.5 sleep
        //PMMCTL0_H = PMMPW_H;                               // Open PMM Registers for write
        //PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF also clears SVS
        // TODO: datasheets say SVS off makes wakeup 10x slower, so need to test when wake works

        __bis_SR_register( LPM4_bits | GIE );                    // Enter LPM3.5

        /*
        PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
        PMMCTL0_L = PMMREGOFF_L | SVSHE;                   // and set PMMREGOFF (go into a x.5 mode on next sleep) and disable low voltage monitor

        __bis_SR_register(LPM3_bits | GIE);                 // Enter LPM3.5
        __no_operation();                                   // For debugger
         */

        while (1) {

            lcd_show< 9,2>();
            __delay_cycles(1000000);
            lcd_show< 9,3>();
            __delay_cycles(1000000);

        }
    }
}


#pragma vector = PORT1_VECTOR

__interrupt void PORT1_ISR(void) {

    SBI( DEBUGA_POUT , DEBUGA_B );

    RV3032_INT_PIV;   // Read and throw away to clear the PORT1 pin change interrupt flag. Only clears the top one but we only expect to have one.

    if (*spin==1) {

        lcd_show< 8,1>();
        *spin=2;

    } else {
        lcd_show< 8,2>();
        *spin=1;

    }

    CBI( DEBUGA_POUT , DEBUGA_B );

}


#pragma vector = RTC_VECTOR

__interrupt void RTC_ISR(void) {

    lcd_show< 9,1>();

    SBI( DEBUGA_POUT , DEBUGA_B );

    // Currently we never make it here in LPM3.5

    //RTCIV;
    //__no_operation();                                   // For debugger


    //(LCDMEM[pos4])++;//= digit[4];

    /*

    (LCDMEM[pos2])= digit[1];


    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5

    (LCDMEM[pos2])= digit[6];

    */

    /*

    Inc_RTC();

    (LCDMEM[pos4]) = digit[4];

    PMMCTL0_H = PMMPW_H;                                // Open PMM Registers for write
    PMMCTL0_L |= PMMREGOFF_L;                           // and set PMMREGOFF
    __bis_SR_register(LPM3_bits | GIE);                 // Re-enter LPM3.5
*/

    CBI( DEBUGA_POUT , DEBUGA_B );

}

